"USSD_ERROR" = "Error performing request";
"USSD_TERMINATED" = "Session Terminated";

"%@ Call Forwarding\n%@\n%@%@" = "%@ Call Forwarding\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Call Waiting\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Call Barring\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Fixed Dialling\n%@";
"Connected Line Presentation\n%@" = "Connected Line Presentation\n%@";
"Calling Line Presentation\n%@" = "Calling Line Presentation\n%@";
"Connected Line ID Restriction\n%@" = "Connected Line ID Restriction\n%@";
"Calling Line ID Restriction\n%@" = "Calling Line ID Restriction\n%@";
"SIM Lock\n%@" = "SIM Lock\n%@";
"Service Center Address\n%@" = "Service Centre Address\n%@";
"Supplementary Service Password\n%@" = "Supplementary Service Password\n%@";
"Calling Name Presentation\n%@" = "Calling Name Presentation\n%@";

"Forwards to %@\n" = "Forwards to %@\n";

"All Calls" = "All Calls";
"All Conditional Calls" = "All Conditional Calls";
"Async Data Circuit" = "Async Data Circuit";
"Data" = "Data";
"Fax" = "Fax";
"Packet Access" = "Packet Access";
"Pad Access" = "Pad Access";
"SMS" = "SMS";
"Sync Data Circuit" = "Sync Data Circuit";
"Voice" = "Voice";

"All Outgoing" = "All Outgoing";
"All Incoming" = "All Incoming";
"Outgoing International" = "Outgoing International";
"Outgoing International, Except Home Country" = "Outgoing International, Except Home Country";
"Incoming While Roaming Outside Home Country" = "Incoming While Roaming Outside Home Country";
"Incoming, Not On SIM" = "Incoming, Not On SIM";
"All Services" = "All Services";
"All Outgoing Services" = "All Outgoing Services";
"All Incoming Services" = "All Incoming Services";

"Disabled" = "Disabled";
"Enabled" = "Enabled";

"On All Calls" = "On All Calls";
"When Busy" = "When Busy";
"When Unanswered" = "When Unanswered";
"When Unreachable" = "When Unreachable";

"Setting %@ Succeeded" = "Setting %@ Succeeded\n";
"Setting Interrogation Succeeded" = "Setting Interrogation Succeeded\n";
"Setting %@ Failed" = "Setting %@ Failed\n";
"Setting Interrogation Failed" = "Setting Interrogation Failed\n";

"Not Available" = "Not Available";
"Network Controlled" = "Network Controlled";
"Temporarily Disabled" = "Temporarily Disabled";
"Temporarily Enabled" = "Temporarily Enabled";
"Unknown" = "Unknown";

"Activation" = "Activation";
"Deactivation" = "Deactivation";
"Interrogation" = "Interrogation";
"Registration" = "Registration";
"Erasure" = "Erasure";

"No Address" = "No Address";
"No Service Specified" = "No Service Specified";
"Type %d" = "Type %d";

// generic error
"CALL_FAILED" = "Call Failed";
// error codes
"kCTNoError" = "No Error";
"kCTUnknownError" = "Unknown Error";
"kCTErrorRadioFailure" = "Radio Failure";
// Generic network errors
"kCTErrorNetworkFailure" = "Network Failure";
"kCTErrorCongestion" = "Network Congested";
"kCTErrorUnidentifiedSubscriber" = "Unidentified Subscriber";
"kCTErrorFacilityRejected" = "Facility Rejected";
"kCTErrorUnknownSubscriber" = "Unknown Subscriber";
"kCTErrorNetworkOutOfOrder" = "Network Out of Order";
"kCTErrorInvalidTransactionIdentifier" = "Invalid Transaction Identifier";
"kCTErrorSemanticallyIncorrectMessage" = "Semantically Incorrect Message";
"kCTErrorInvalidMandatoryInformation" = "Invalid Mandatory Information";
"kCTErrorMessageTypeNonExistant" = "Message Type Non-existent";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Message Not Compatible With Protocol State";
"kCTErrorInformationElementNonExistant" = "Information Element Non-existent";
"kCTErrorProtocolErrorUnspecified" = "Protocol Error Unspecified";
"kCTErrorTemporaryFailure" = "Temporary Failure";
"kCTErrorResourcesUnavailable" = "Resources Unavailable";
"kCTErrorRequestedFacilityNotSubscribed" = "Requested Facility Not Subscribed";
"kCTErrorRequestedFacilityNotImplemented" = "Requested Facility Not Implemented";
"kCTErrorInterworkingError" = "Interworking Error";
"kCTErrorInterworkingNotSupported" = "Interworking Not Supported";
"kCTErrorCommandCannotBeActioned" = "Command Cannot Be Actioned";
"kCTErrorNoNetworkService" = "No Network Service";
// Call related errors
"kCTErrorUnassignedNumber" = "Unassigned Number";
"kCTErrorOperatorDeterminedBarring" = "Operator Determined Barring";
"kCTErrorCallBarred" = "Call Barred";
"kCTErrorUserBusy" = "User Busy";
"kCTErrorNoUserResponding" = "No User Responding";
"kCTErrorNumberChanged" = "Number Changed";
"kCTErrorInvalidNumberFormat" = "Invalid Number Format";
"kCTErrorCallRejected" = "Call Rejected";
// SIM errors
"kCTErrorSimNotInserted" = "SIM Not Inserted";
"kCTErrorSimPinRequired" = "SIM PIN Required";
"kCTErrorSimPukRequired" = "SIM PUK Required";
"kCTErrorSimFailure" = "SIM Failure";
"kCTErrorSimMemoryFailure" = "SIM Memory Failure";
"kCTBadPinFormatError" = "Bad PIN Format";
"kCTErrorNumberNotAllowed" = "Number not Allowed";
"kCTErrorIncorrectPassword" = "Incorrect Password";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Short Message Transfer Rejected";
"kCTErrorDestinationOutOfOrder" = "Destination Out of Order";
"kCTErrorClass0NotSupported" = "Class 0 Not Supported";
"kCTErrorCannotReplaceSm" = "Cannot Replace SIM";
"kCTErrorUnspecifiedPid" = "Unspecified PID";
"kCTErrorDataCodingSchemeNotSupported" = "Data Coding Scheme Not Supported";
"kCTErrorUnspecifiedDcs" = "Unspecified DCS Error";
"kCTErrorCommandUnsupported" = "Command Unsupported";
"kCTErrorUnspecifiedTpCommand" = "Unspecified TP Command Error";
"kCTErrorTpduNotSupported" = "TPDU Not Supported";
"kCTErrorScBusy" = "SC Busy";
"kCTErrorRejectedBySimSmsControl" = "Rejected by SIM SMS Control";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS Illegal MS";
"kCTErrorGprsIllegalMe" = "GPRS Illegal ME";
"kCTErrorGprsServicesNotAllowed" = "GPRS Services Not Allowed";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN Not Allowed";
"kCTErrorGprsLocationAreaNotAllowed" = "GPRS Location Area Not Allowed";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "GPRS Roaming Not Allowed In Location Area";
"kCTErrorGprsServiceOptionNotSupported" = "GPRS Service Option Not Supported";
"kCTErrorGprsServiceOptionNotSubscribed" = "GPRS Service Option Not Subscribed";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "GPRS Service Option Temporarily Out of Order";
"kCTErrorGprsPdpAuthenticationFailure" = "GPRS PDP Authentication Failure";
"kCTErrorGprsInvalidMobileClass" = "GPRS Invalid Mobile Class";
"kCTErrorGprsUnspecified" = "GPRS Unspecified";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS Missing or Unknown APN";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "GPRS PDP Authentication Info Rejected by Baseband";
